# -*- fill-column: 80; org-confirm-babel-evaluate: nil -*-

#+TITLE:     Assignment 13, Introduction To Mathematics
#+AUTHOR:    Oleg Sivokon
#+EMAIL:     olegsivokon@gmail.com
#+DATE:      <2014-11-22 Sat>
#+DESCRIPTION: Second asssignment in the course Introduction To Mathematics
#+KEYWORDS: Introduction To Mathematics, Assignment, Set Theory
#+LANGUAGE: en
#+LaTeX_CLASS: article
#+LATEX_HEADER: \usepackage[usenames,dvipsnames]{color}
#+LATEX_HEADER: \usepackage[backend=bibtex, style=numeric]{biblatex}
#+LATEX_HEADER: \usepackage{commath}
#+LATEX_HEADER: \usepackage{tikz}
#+LATEX_HEADER: \usetikzlibrary{shapes,backgrounds}
#+LATEX_HEADER: \usepackage{marginnote}
#+LATEX_HEADER: \usepackage{listings}
#+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \usepackage{enumerate}
#+LATEX_HEADER: \hypersetup{urlcolor=blue}
#+LATEX_HEADER: \hypersetup{colorlinks,urlcolor=blue}
#+LATEX_HEADER: \addbibresource{bibliography.bib}
#+LATEX_HEADER: \setlength{\parskip}{16pt plus 2pt minus 2pt}
#+LATEX_HEADER: \definecolor{codebg}{rgb}{0.96,0.99,0.8}
#+LATEX_HEADER: \definecolor{codestr}{rgb}{0.46,0.09,0.2}

#+BEGIN_SRC emacs-lisp :exports none
(setq org-latex-pdf-process
        '("latexmk -pdflatex='pdflatex -shell-escape -interaction nonstopmode' -pdf -bibtex -f %f")
        org-latex-listings t
        org-src-fontify-natively t
        org-babel-latex-htlatex "htlatex")
#+END_SRC

#+RESULTS:
: htlatex

#+BEGIN_LATEX
  \lstset{ %
    backgroundcolor=\color{codebg},
    basicstyle=\ttfamily\scriptsize,
    breakatwhitespace=false,         % sets if automatic breaks should only happen at whitespace
    breaklines=false,
    captionpos=b,                    % sets the caption-position to bottom
    commentstyle=\color{mygreen},    % comment style
    framexleftmargin=10pt,
    xleftmargin=10pt,
    framerule=0pt,
    frame=tb,                        % adds a frame around the code
*** Answer 9

    The example of a group which is non-commutative, but has elements which are
    their own inverses could be a dyhedral group of rank 6.  I found a mention
    of this group on the internet, so I didn't come up with it myself.  I've
    verified by direct calculation that it indeed meets the requirements.

    |   |   | 1 | a | b | c | d | e |
    |---+---+---+---+---+---+---+---|
    | / |   | < |   |   |   |   |   |
    |   | 1 | 1 | a | b | c | d | e |
    |   | a | a | 1 | c | b | e | d |
    |   | b | b | d | 1 | e | a | c |
    |   | c | c | e | a | d | c | b |
    |   | d | d | b | e | 1 | c | a |
    |   | e | e | c | d | a | b | 1 |

    The calculation follows.

    First define some utility functions:
    
    \clearpage
    
    #+BEGIN_SRC lisp :exports code :session groups
      (defun op (table elements)
        "Creates an operation from the TABLE describing the results
      of this operation on the group of ELEMENTS."
        (lambda (a b)
          (loop :with result := (aref table (car a) (car b))
             :for (head . tail) :in elements :do
             (when (eql tail result)
               (return (cons head tail))))))
      
      (defun elements (table)
        "Collects all the elements of the group whose operation is
      defined in TABLE."
        (loop :for i :below (array-dimension table 0)
           :collect (cons i (aref table i 0))))
    #+END_SRC

    Next define the predictates validating different aspects of the
    group.
    
    #+BEGIN_SRC lisp :exports code :session groups
      (defun verify-associativity (operations-table)
        (loop
           :with elements := (elements operations-table)
           :with op := (op operations-table elements)
           :for x :in elements :do
           (loop :for y :in elements :do
              (loop :for z :in elements :do
                 (unless (equal (funcall op (funcall op x y) z)
                                (funcall op x (funcall op y z)))
                   (return-from verify-associativity
                     (list x y z)))))))
      
      (defun find-identity (operations-table)
        "Searches for identity element of the group defined by
      OPERATIONS-TABLE."
        (loop
           :with elements := (elements operations-table)
           :with op := (op operations-table elements)
           :for x :in elements :do
           (loop :for y :in elements :do
              (unless (equal (funcall op x y) (funcall op y x))
                (return))
              :finally (return-from find-identity (cdr x)))))
      
      (defun find-inverses (operations-table identity-element)
        "Searches for inverses of each element of the group given
      by the OPERATIONS-TABLE.  This relies on the identity element
      being previously calculated."
        (loop
           :with elements := (elements operations-table)
           :with op := (op operations-table elements)
           :for x :in elements :nconc
           (loop :for y :in elements
              :when (eql (cdr (funcall op x y)) identity-element)
              :collect (list (cdr x) (cdr y)))))
    #+END_SRC

    Similarly, define a predicate for commutativity:
    
    #+BEGIN_SRC lisp :exports code :session groups
      (defun verify-commutativity (operations-table)
        "Verifies whether the group given by OPERATIONS-TABLE
       is commutative."
        (loop
           :with elements := (elements operations-table)
           :with op := (op operations-table elements)
           :for x :in elements :do
           (loop :for y :in elements :do
              (unless (equal (funcall op x y) (funcall op y x))
                (return-from verify-commutativity
                  (list (cdr x) (cdr y) 
                        (cdr (funcall op x y))
                        (cdr (funcall op y x))))))))
    #+END_SRC

    Finally, print out the results:
    
    #+BEGIN_SRC lisp :exports both :session groups
      (defun print-report ()
        "Prints the report fo dyhedral group of rank 6."
        (let* ((dyhedral-group-6
                (make-array 
                 (list 6 6)
                 :initial-contents
                 '((1 a b c d e)
                   (a 1 c b e d)
                   (b d 1 e a c)
                   (c e a d 1 b)
                   (d b e 1 c a)
                   (e c d a b 1))))
               (associativity (verify-associativity dyhedral-group-6))
               (identity (find-identity dyhedral-group-6))
               (inverses (find-inverses dyhedral-group-6 identity))
               (commutativity (verify-commutativity dyhedral-group-6)))
          (list
           (list "associativity" (null associativity))
           (list "identity" identity)
           (list "inverses" (format nil "~($~{~{~s*~s^{-1}~}=~}1$~)" 
                                    inverses))
           (list "commutativity"
            (apply 'format nil "~($~s*~s=~s, ~3:*~s*~s=~*~s$~)" 
                   commutativity)))))
      
      (print-report)
    #+END_SRC

    #+RESULTS:
    | associativity | T                                                         |
    | identity      | 1                                                         |
    | inverses      | $1*1^{-1}=a*a^{-1}=b*b^{-1}=c*d^{-1}=d*c^{-1}=e*e^{-1}=1$ |
    | commutativity | $a*b=c, a*b=d$                                            |

